Revit 2027 API
RibbonPanel.Title Property
Gets or sets the text of the RibbonPanel.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Title { get; set; }
Public Property Title As String
	Get
	Set
public:
property String^ Title {
	String^ get ();
	void set (String^ value);
}
member Title : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException | Thrown when the title contains angle bracket.
Remarks
If this property is not set, the default value is its Name.
See Also
Reference
RibbonPanel Class
Autodesk.Revit.UI Namespace